solar_opposites_api/app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def show
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]